# Задание 5: БПФ

Требуется написать программу, которая по вектору коэффициентов многочлена a0+a1x+…+an−1xn−1a0+a1x+…+an−1xn−1 вычисляет вектор значений этого многочлена в точках ω0,…,ωn−1ω0,…,ωn−1 — комплексных корнях степени nn из единицы. Корень ωkωk равен cos(2πk/n)+isin(2πk/n)cos⁡(2πk/n)+isin⁡(2πk/n). Гарантируется, что nn — степень двойки. Программа должна работать за время O(nlogn)O(nlog⁡n). Входные данные: через пробел перечислены коэффициенты многочлена (действительные числа). Программа должна выдавать значения многочлена, разделяя их пробелами и выдавая через запятую действительную и мнимую часть числа. Ниже приведён алгоритм (Python 3.6), решающий поставленную задачу за время O(n2)O(n2):

```
from math import pi, sin, cos


def polynomial(coeffs, x):
    return sum(a * x ** k for k, a in enumerate(coeffs))


coeffs = list(map(float, input().strip().split()))

n = len(coeffs)

result = [
    polynomial(coeffs, cos(2 * pi * k / n) + 1j * sin(2 * pi * k / n))
    for k in range(n)
]

print(' '.join(f'{x.real},{x.imag}' for x in result))
```
