# Задание 5: БПФ

Требуется написать программу, которая по вектору коэффициентов многочлена $a_0 + a_1 x + \ldots + a_{n-1}x^{n-1}$ вычисляет вектор значений этого многочлена в точках $w_0, \ldots, w_{n-1}$ — комплексных корнях степени $n$ из единицы. Корень $ω_k$ равен $\cos(2 \pi k/n)+i\sin(2 \pi k/n)$. Гарантируется, что $n$ — степень двойки. Программа должна работать за время $O(n \log n)g$. Входные данные: через пробел перечислены коэффициенты многочлена (действительные числа). Программа должна выдавать значения многочлена, разделяя их пробелами и выдавая через запятую действительную и мнимую часть числа. Ниже приведён алгоритм (Python 3.6), решающий поставленную задачу за время $O(n^2)g$:

```
from math import pi, sin, cos


def polynomial(coeffs, x):
    return sum(a * x ** k for k, a in enumerate(coeffs))


coeffs = list(map(float, input().strip().split()))

n = len(coeffs)

result = [
    polynomial(coeffs, cos(2 * pi * k / n) + 1j * sin(2 * pi * k / n))
    for k in range(n)
]

print(' '.join(f'{x.real},{x.imag}' for x in result))
```
